{
  "paragraft": [
    "هل تساءلت يومًا كيف يمكن عرض النصوص، والصور، ومقاطع الفيديو، والعناصر الأخرى على صفحة الويب؟ حسنًا، يمكنك فعل كل ذلك باستخدام HTML!",
    "آه، إذًا علينا تعلم HTML أولًا، صحيح؟",
    "نعم، HTML هو بمثابة الأساس لكل صفحة ويب. لذا، قبل تعلم أي لغة برمجة أخرى، من الضروري أن تفهم كيفية بناء هيكل صفحة الويب باستخدام HTML.",
    "هل تعلم HTML أمرٌ صعب؟",
    "لا داعي للقلق — HTML سهل جدًا! كل ما عليك فعله هو حفظ بعض الوسوم الأساسية مثل <p> للفقرات، و<h1> للعناوين، و<a> للروابط. بعد ذلك، يمكنك البدء في إنشاء صفحتك الأولى!",
    "بسيط، أليس كذلك؟",
    "دعنا نأخذ مثالًا بسيطًا — لنفترض أنك تريد كتابة قصة قصيرة. القصة عادةً ما تحتوي على عنوان، وفقرات، وربما صورة. انظر إلى الصندوق أدناه:",
    "من خلال المثال أعلاه، يمكننا فهم البنية الأساسية لـ HTML. يتم تغليف كل جملة أو فقرة بالوسم المناسب. على سبيل المثال، نُغلف العنوان بوسم <h4> والفقرات بوسم <p>. بهذه الطريقة، يعرف المتصفح ما يجب عرضه كعنوان وما يجب عرضه كفقرة.",
    "سهل، أليس كذلك؟ إذًا، HTML هو لغة تساعدنا على إخبار المتصفح بكيفية عرض المحتوى. يمكننا بسهولة إضافة نصوص، صور، فيديوهات، وغيرها من العناصر. فقط استخدم الوسوم المناسبة، وسيفهم المتصفح ما نريد.",
    "هل ترغب في معرفة المزيد؟"
  ],
  "definition": {
    "title": "التعريف",
    "content": {
      "text": "HTML (لغة ترميز النص الفائق) هي اللغة القياسية لإنشاء صفحات الويب. تُستخدم HTML في تنظيم محتوى الويب مثل النصوص، والصور، والروابط، والعناصر الأخرى. باستخدام HTML، يمكننا تحديد كيفية عرض هذه العناصر في المتصفح.",
      "highlight": "HTML (لغة ترميز النص الفائق)"
    }
  },
  "example": {
    "title": "مثال على هيكل HTML",
    "button": {
      "text": "نص",
      "explanation": "شرح"
    },
    "content": {
      "title": "قطعة خبز في يوم الأحد",
      "paragraphs": [
        "في قرية صغيرة محاطة بحقول الأرز الخضراء والسماء الزرقاء الواسعة، كان هناك صبي يُدعى راكا. كان يعيش مع والدته في منزل خشبي بسيط. ومنذ وفاة والده، كانت والدته تعمل كبائعة متجولة للمأكولات المقلية لكسب لقمة العيش.",
        "في صباح كل يوم أحد، كان راكا يجلس أمام المنزل منتظرًا عودة والدته من السوق. كان يوم الأحد يومًا مميزًا — ليس لأنه لا توجد مدرسة، بل لأن والدته كانت دائمًا تحضر له قطعة خبز متبقية من بضائعها التي لم تُبع."
      ]
    }
  }
}
